LuisNinoF/Bootloaders-Firmware-Update/P2_STM32_Bootloader_SD_card_/Src/timebase.c
#include "timebase.h"
#include "stm32f4xx.h"

#define CTRL_ENABLE		(1U<<0)
#define CTRL_TICKINT	(1U<<1)
#define CTRL_CLCKSRC	(1U<<2)
#define CTRL_COUNTFLAG	(1U<<16)

#define ONE_SEC_LOAD	 16000000
#define ONE_MSEC_LOAD	 16000


#define TICK_FREQ		 1

volatile uint32_t g_curr_tick;
volatile uint32_t g_curr_tick_p;


volatile uint8_t g_fatfs_cnt = 0;
volatile uint16_t g_tmr_cnt1;
volatile uint16_t g_tmr_cnt2;

/*Delay in seconds*/
void delay(uint32_t delay)
{
	uint32_t tickstart =  get_tick();
	uint32_t wait =  delay;

	if(wait < MAX_DELAY)
	{
		wait += (uint32_t)TICK_FREQ;
	}

    while((get_tick() - tickstart) < wait){}

}

uint32_t get_tick(void)
{
	__disable_irq();
	g_curr_tick_p = g_curr_tick;
	__enable_irq();

	return g_curr_tick_p;

}
static void tick_increment(void)
{
	g_curr_tick += TICK_FREQ;
}
void timebase_init(void)
{

	/*Disable global interrupts*/
	__disable_irq();

    /*Load the timer with number of clock cycles per msecond*/
	SysTick->LOAD =  ONE_MSEC_LOAD - 1;

    /*Clear systick current value register*/
	SysTick->VAL = 0;

    /*Select internal clock source*/
	SysTick->CTRL = CTRL_CLCKSRC;

    /*Enable interrupt*/
	SysTick->CTRL |= CTRL_TICKINT;

	/*Enable systick*/
	SysTick->CTRL |=CTRL_ENABLE;

	/*Enable global interrupts*/
	__enable_irq();
}


void fatfs_tmr_callback(void)
{
	if(g_tmr_cnt1 > 0)
	{
		g_tmr_cnt1--;
	}

	if(g_tmr_cnt2 > 0)
	{
		g_tmr_cnt2--;
	}
}
void SysTick_Handler(void)
{
	tick_increment();
	g_fatfs_cnt++;
	if(g_fatfs_cnt >= 10)
	{
		g_fatfs_cnt = 0;
		fatfs_tmr_callback();
	}
}
